import os
from dotenv import load_dotenv
from sqlalchemy.orm import sessionmaker
from database import engine

SessionLocal = sessionmaker(bind=engine)

load_dotenv()

TOKEN = os.getenv("TOKEN_BOT")


VALID_REGIONS = [
    "Вінницька", "Волинська", "Дніпропетровська", "Донецька", "Житомирська",
    "Закарпатська", "Запорізька", "Івано-Франківська", "Київська", "Кіровоградська",
    "Луганська", "Львівська", "Миколаївська", "Одеська", "Полтавська",
    "Рівненська", "Сумська", "Тернопільська", "Харківська", "Херсонська",
    "Хмельницька", "Черкаська", "Чернігівська", "Чернівецька", "АР Крим",
]

STATUS_OPTIONS = ["Мама", "Вагітна"]

INTEREST_OPTIONS = [
    "Грудне вигодовування",
    "Штучне вигодовування",
    "Змішане вигодовування",
    "Вакцинація",
    "Психічне здоровʼя",
    "Онлайн-робота",
    "Фітнес",
]
